{"pageProps":{"breadcrumbs":[{"href":"/","label":"Home"},{"href":"/foundations","label":"Foundations"},{"label":"Design principles"}],"foundation":{"slug":"design-principles","source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    h2: \"h2\",\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.h2, {\n      children: \"This is for everyone\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Our design system is inspired by the original Australian Government Design System (GOLD) which was built on principles of simplicity and accessibility. We do the hard work to make a simple and easy to use system because people who use government services generally don’t have a choice, they can’t go to an alternative service provider. We have an obligation to make our government services simple and fast to use, inclusive and accessible to all users in the location and context they need to use them.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If something is decorative, adds cognitive load, adds unnecessary bloat, or may create challenges for some users - rethink it to make the experience simple and intuitive for all.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"User’s needs come first\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There are two main user groups of AgDS we consider - the internal users (designers, developers and researchers) who develop government services, and the end users of those services. We want the Design System to be easy to apply to the everyday problems encountered by digital practitioners in government, giving them inclusive and high-quality tools, which allow them to serve their end users’ needs to access inclusive government services.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Consistent, not uniform\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We aim to provide a consistent appearance and behaviour of common components and templates across digital government services, minimising the learning curve for users moving between services. Developers and designers that use the Design System can customise the system theme (colour schemes, typography and sub-logos) while maintaining a consistent visual language and user experience.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Function over fashion\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Delivering highly accessible, highly usable digital services requires doing the basics simply, clearly and quickly. We aim to respect our users’ time and bandwidth, avoiding complexity, anti-patterns or faddish design trends that may delay or disrupt them. We communicate, not decorate, by removing any details or elements from the system that aren’t necessary to improve the experience for the end user.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Evidence over opinion\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We believe that consulting with many sources creates better insights, so we aim to involve the design community in everything we do. We are open in our processes and research, seeking feedback where possible, documenting decisions and producing rationale for published work.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{"title":"Design principles","description":"Principles for how we design."}},"content":"\n## This is for everyone\n\nOur design system is inspired by the original Australian Government Design System (GOLD) which was built on principles of simplicity and accessibility. We do the hard work to make a simple and easy to use system because people who use government services generally don’t have a choice, they can’t go to an alternative service provider. We have an obligation to make our government services simple and fast to use, inclusive and accessible to all users in the location and context they need to use them.\n\nIf something is decorative, adds cognitive load, adds unnecessary bloat, or may create challenges for some users - rethink it to make the experience simple and intuitive for all.\n\n## User’s needs come first\n\nThere are two main user groups of AgDS we consider - the internal users (designers, developers and researchers) who develop government services, and the end users of those services. We want the Design System to be easy to apply to the everyday problems encountered by digital practitioners in government, giving them inclusive and high-quality tools, which allow them to serve their end users’ needs to access inclusive government services.\n\n## Consistent, not uniform\n\nWe aim to provide a consistent appearance and behaviour of common components and templates across digital government services, minimising the learning curve for users moving between services. Developers and designers that use the Design System can customise the system theme (colour schemes, typography and sub-logos) while maintaining a consistent visual language and user experience.\n\n## Function over fashion\n\nDelivering highly accessible, highly usable digital services requires doing the basics simply, clearly and quickly. We aim to respect our users’ time and bandwidth, avoiding complexity, anti-patterns or faddish design trends that may delay or disrupt them. We communicate, not decorate, by removing any details or elements from the system that aren’t necessary to improve the experience for the end user.\n\n## Evidence over opinion\n\nWe believe that consulting with many sources creates better insights, so we aim to involve the design community in everything we do. We are open in our processes and research, seeking feedback where possible, documenting decisions and producing rationale for published work.\n","data":{"title":"Design principles","description":"Principles for how we design."},"title":"Design principles","description":"Principles for how we design."},"toc":[{"id":"this-is-for-everyone","title":"This is for everyone","level":2,"slug":"this-is-for-everyone","items":[]},{"id":"users-needs-come-first","title":"User’s needs come first","level":2,"slug":"users-needs-come-first","items":[]},{"id":"consistent-not-uniform","title":"Consistent, not uniform","level":2,"slug":"consistent-not-uniform","items":[]},{"id":"function-over-fashion","title":"Function over fashion","level":2,"slug":"function-over-fashion","items":[]},{"id":"evidence-over-opinion","title":"Evidence over opinion","level":2,"slug":"evidence-over-opinion","items":[]}]},"__N_SSG":true}