{"pageProps":{"title":"Guides","description":"Learn how to use the Agriculture Design System to design and build your project.","guideList":[{"order":1,"title":"Getting started","opener":"Welcome to AgDS - the Design System for the Australian Government Department of Agriculture, Fisheries and Forestry. In this guide we are going to go through the steps necessary to get started with the React component library from our Design System.","overview":"Get up and running with the AgDS React component library.","slug":"getting-started"},{"order":2,"title":"Contribution guidelines","opener":"Contributing to the Agriculture Design System.","overview":"Contributing to the Agriculture Design System.","slug":"contribution"},{"order":100,"title":"Responsive props","opener":"The Agriculture Design System provides first class support for mobile-first responsive styles. Instead of manually writing CSS media queries throughout your codebase, our primitive components allow you to provide arrays and objects to generate responsive styles in your project.","overview":"AgDS provides first class support for mobile-first responsive styles.","slug":"responsive-props"},{"order":100,"title":"How to create guidance in the Export Service","opener":null,"overview":"Get started to create clear and consistent guidance in the Export Service.","slug":"how-to-write-guidance"},{"order":100,"title":"Forms","opener":"Web forms are one of the main points of interaction between a user and a web site or application. In this guide, we will be building a simple sign in form using two popular libraries react-hook-form and yup.","overview":"Building a simple sign in form using AgDS components, react-hook-form and yup.","slug":"forms"},{"order":100,"title":"Using Figma","opener":"How to access the AgDS design files.","overview":"How to access the AgDS design files.","slug":"figma"},{"order":100,"title":"Creating a custom theme","opener":"How to create theme for your brand in the React component library.","overview":"How to create theme for your brand in the React component library.","slug":"custom-theme"},{"order":100,"title":"Change management","opener":"How we classify and communicate changes to our design system.","overview":"How we classify and communicate changes to our design system.","slug":"change-management"}]},"__N_SSG":true}