{"pageProps":{"guide":{"slug":"change-management","content":"\nThe design system is a living piece of software and is constantly evolving to meet the needs of our users. We want to ensure that we are communicating changes to our users in a way that is clear and easy to understand.\n\nSee our [updates page](https://design-system.agriculture.gov.au/updates) for our changelog.\n\n## Release cadence\n\nWe aim to release a new version of the design system [via npm](https://www.npmjs.com/package/@ag.ds-next/react) every two weeks, or the end of a sprint. This ensures that we are releasing changes regularly and giving our users a chance to provide feedback on changes before they are released.\n\nThis is a general guideline and we may release more frequently if there are important changes to be released.\n\n## Change Types\n\nWhen contributing changes to the design system, it is important to understand how we classify and communicate them. This helps us to understand the impact of changes and to communicate them to our users.\n\nWe follow the [Semantic Versioning](https://semver.org/) system to classify changes. This system uses three classificatons to describe the type of change...\n\n- Patch\n- Minor\n- Major\n\n### Patch (fix)\n\nA change that fixes a bug or makes a small improvement which does not affect the API of the component. The consumer isn't expected to change their code in order to implement the update.\n\nFor example...\n\n- A minor visual change to a component\n- Resolving a crash or other kind of bug\n\nThe GitHub pull request related to a patch change can reviewed, merged and released as soon as a AgDS team member is free.\n\n### Minor (feature)\n\nA new feature to an existing component, or the introduction of a new standalone component. The user can elect to implement the change but isn't forced to change existing code.\n\nFor example...\n\n- A new component\n- A new prop on an existing component\n\nThe GitHub pull request related to a patch change can be reviewed, merged and released as soon as a AgDS team member is free.\n\n### Major (breaking)\n\nA change which breaks the API of existing component(s). A user is expected to make a change to their code in order for it to continue working.\n\nFor example...\n\n- Removing a component\n- Removing a prop from a component\n- Changing the API, behaviour or name of a component\n\n**Before this can be merged**, the community must be given a chance to give feedback on the change. Please follow the following steps.\n\n- Consult the Design System team of the change you intend to make\n- Open the PR as a draft, and add the \"breaking\" label. Notify the AgDS team\n- AgDS team will notify the community via the \"Design System\" chat in Microsoft Teams\n- Leave the PR open for at least one week, to give the community a chance to give feedback by commenting on the GitHub Pull Request\n- Consider the feedback given and make any changes\n- The AgDS team will decide whether to merge the PR and release the change\n\n### 'No change'\n\nChanges that do not effect our published artefacts such as the documentation website updates do not require any versioning updates.\n\n## Deprecation\n\nAs a general rule, we do our best to design with the future in mind, to avoid breaking changes. However, sometimes new information or ideas come to light which mean that we need to change our approach. In these cases, we will deprecate a component or prop.\n\nDeprecation is a process of warning users that a component or prop will be removed in a future release. This gives users a chance to update their code before the change is made.\n\nIf we intend to deprecate a component or prop, the process for commmunicating breaking changes, as outlined above, must be followed. A Github Pull Request will be created as a draft and will include the \"deprecation\" label. The community will be given one week to give feedback, before we decide whether to merge the PR and release the change.\n\n## About Changesets\n\nWe use [Changesets](https://github.com/changesets/changesets) to communicate the changes to our users and to automate the release process.\n\nEvery pull request which changes a component must include a changeset file. This file describes the change, and is used to generate the release notes and to determine the version number of the next release.\n\nTo create a changeset, run `yarn changeset` in the root of the repository. Then commit the changeset file and push it to your branch.\n","source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    a: \"a\",\n    h2: \"h2\",\n    ul: \"ul\",\n    li: \"li\",\n    h3: \"h3\",\n    strong: \"strong\",\n    code: \"code\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"The design system is a living piece of software and is constantly evolving to meet the needs of our users. We want to ensure that we are communicating changes to our users in a way that is clear and easy to understand.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"See our \", _jsx(_components.a, {\n        href: \"https://design-system.agriculture.gov.au/updates\",\n        children: \"updates page\"\n      }), \" for our changelog.\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Release cadence\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"We aim to release a new version of the design system \", _jsx(_components.a, {\n        href: \"https://www.npmjs.com/package/@ag.ds-next/react\",\n        children: \"via npm\"\n      }), \" every two weeks, or the end of a sprint. This ensures that we are releasing changes regularly and giving our users a chance to provide feedback on changes before they are released.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This is a general guideline and we may release more frequently if there are important changes to be released.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Change Types\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When contributing changes to the design system, it is important to understand how we classify and communicate them. This helps us to understand the impact of changes and to communicate them to our users.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"We follow the \", _jsx(_components.a, {\n        href: \"https://semver.org/\",\n        children: \"Semantic Versioning\"\n      }), \" system to classify changes. This system uses three classificatons to describe the type of change...\"]\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Patch\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Minor\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Major\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Patch (fix)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A change that fixes a bug or makes a small improvement which does not affect the API of the component. The consumer isn't expected to change their code in order to implement the update.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"For example...\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"A minor visual change to a component\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Resolving a crash or other kind of bug\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The GitHub pull request related to a patch change can reviewed, merged and released as soon as a AgDS team member is free.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Minor (feature)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A new feature to an existing component, or the introduction of a new standalone component. The user can elect to implement the change but isn't forced to change existing code.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"For example...\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"A new component\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"A new prop on an existing component\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The GitHub pull request related to a patch change can be reviewed, merged and released as soon as a AgDS team member is free.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Major (breaking)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A change which breaks the API of existing component(s). A user is expected to make a change to their code in order for it to continue working.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"For example...\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Removing a component\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Removing a prop from a component\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Changing the API, behaviour or name of a component\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"Before this can be merged\"\n      }), \", the community must be given a chance to give feedback on the change. Please follow the following steps.\"]\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Consult the Design System team of the change you intend to make\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Open the PR as a draft, and add the \\\"breaking\\\" label. Notify the AgDS team\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"AgDS team will notify the community via the \\\"Design System\\\" chat in Microsoft Teams\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Leave the PR open for at least one week, to give the community a chance to give feedback by commenting on the GitHub Pull Request\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Consider the feedback given and make any changes\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"The AgDS team will decide whether to merge the PR and release the change\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"'No change'\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Changes that do not effect our published artefacts such as the documentation website updates do not require any versioning updates.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Deprecation\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"As a general rule, we do our best to design with the future in mind, to avoid breaking changes. However, sometimes new information or ideas come to light which mean that we need to change our approach. In these cases, we will deprecate a component or prop.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Deprecation is a process of warning users that a component or prop will be removed in a future release. This gives users a chance to update their code before the change is made.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If we intend to deprecate a component or prop, the process for commmunicating breaking changes, as outlined above, must be followed. A Github Pull Request will be created as a draft and will include the \\\"deprecation\\\" label. The community will be given one week to give feedback, before we decide whether to merge the PR and release the change.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"About Changesets\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"We use \", _jsx(_components.a, {\n        href: \"https://github.com/changesets/changesets\",\n        children: \"Changesets\"\n      }), \" to communicate the changes to our users and to automate the release process.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Every pull request which changes a component must include a changeset file. This file describes the change, and is used to generate the release notes and to determine the version number of the next release.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"To create a changeset, run \", _jsx(_components.code, {\n        children: \"yarn changeset\"\n      }), \" in the root of the repository. Then commit the changeset file and push it to your branch.\"]\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{"title":"Change management","opener":"How we classify and communicate changes to our design system."}},"data":{"title":"Change management","opener":"How we classify and communicate changes to our design system."},"title":"Change management","opener":"How we classify and communicate changes to our design system."},"breadcrumbs":[{"href":"/","label":"Home"},{"href":"/guides","label":"Guides"},{"label":"Change management"}],"slug":"change-management","toc":[{"id":"release-cadence","title":"Release cadence","level":2,"slug":"release-cadence","items":[]},{"id":"change-types","title":"Change Types","level":2,"slug":"change-types","items":[{"id":"patch-fix","title":"Patch (fix)","level":3,"slug":"patch-fix","items":[]},{"id":"minor-feature","title":"Minor (feature)","level":3,"slug":"minor-feature","items":[]},{"id":"major-breaking","title":"Major (breaking)","level":3,"slug":"major-breaking","items":[]},{"id":"no-change","title":"'No change'","level":3,"slug":"no-change","items":[]}]},{"id":"deprecation","title":"Deprecation","level":2,"slug":"deprecation","items":[]},{"id":"about-changesets","title":"About Changesets","level":2,"slug":"about-changesets","items":[]}]},"__N_SSG":true}