{"pageProps":{"title":"Patterns","description":"Patterns are reusable compositions of components that solve design problems and help ensure consistency across the service.","patternList":[{"order":100,"title":"Accessible form validation and error recovery","slug":"accessible-form-validation-and-recovery","description":"Form validation is a critical aspect of creating usable and accessible applications. By providing effective error feedback and guidance, you can help users submit accurate information while minimising frustrations."},{"order":100,"title":"Conditionally revealed content","slug":"conditional-reveal","description":"Conditionally reveal a question or information related to a specific radio or checkbox option when a user selects it. This ensures that users only encounter conditionally revealed content when it is applicable to their selection."},{"order":100,"title":"Focus mode","slug":"focus-mode","description":"Used to help reduce distractions so that users can focus on completing a specific task."},{"order":100,"title":"Loading, empty and error states","slug":"loading-error-empty-states","description":"When loading data in an application, it is important to consider and design for loading, empty, and error states. These states will help set user expectations and prevent them from assuming that the interface is unresponsive."},{"order":100,"title":"Messaging","slug":"messaging","description":"Messaging conveys contextual information to the user, provides information in relation to a service or interaction, and provides feedback in response to their actions or the current system status."},{"order":100,"title":"Multi-task form","slug":"multi-task-form","description":"Use this pattern to break up large forms into multiple smaller tasks to decrease cognitive load."},{"order":100,"title":"Search filters","slug":"search-filters","description":"Search filters help users find what they’re looking for by displaying options that meet specified criteria."},{"order":100,"title":"Selectable tables with batch actions","slug":"selectable-table-with-batch-actions","description":"Selectable tables allow users to select one or more rows simultaneously and perform batch actions against the selected rows. A batch action is any action that can be performed against any selectable row of a table."},{"order":100,"title":"Selecting multiple options","slug":"selecting-multiple-options","description":"Multi-select is a commonly used design pattern that allows users to select multiple options from a list. This pattern is used in various contexts such as search filters, form fields, and more."}]},"__N_SSG":true}