{"pageProps":{"document":{"slug":"content-principles","source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h2: \"h2\",\n    a: \"a\",\n    hr: \"hr\",\n    ul: \"ul\",\n    li: \"li\"\n  }, _provideComponents(), props.components), {BackToTop, FootnotesList} = _components;\n  if (!BackToTop) _missingMdxReference(\"BackToTop\", true);\n  if (!FootnotesList) _missingMdxReference(\"FootnotesList\", true);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"You can use these standards to guide you to create content that is clear and effective.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Good content reduces the cognitive load on users and helps them achieve their aims more easily.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It provides everything users need to complete their task. But it does not increase their cognitive load with details they don’t.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Based on user needs\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Good content is based on evidence of our users’ needs.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"For example, users who need to apply for a permit don’t need to understand the history of changes to related laws.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Understand the primary user need for any service or product and design content to meet it.\"\n    }), \"\\n\", _jsx(BackToTop, {}), \"\\n\", _jsx(_components.h2, {\n      children: \"Plain language\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Just less than half of all Australians have a low level of literacy. \", _jsx(\"sup\", {\n        children: _jsx(\"a\", {\n          href: \"#cite-1\",\n          id: \"ref-1\",\n          children: \"1\"\n        })\n      })]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Those people who read at a high level of literacy don’t want to spend any more time to do a task than they need to. Everyone benefits from plain language.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When you write and design content, use plain English. It should be as simple and clear as possible while still meeting the needs of users. Use short and simple words where you can.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"For more information, see the ‘Writing in plain English’ section of the Writing guidance page (internal DAFF staff only). You can find it on DAFF’s SharePoint intranet site, The source.\"\n    }), \"\\n\", _jsx(BackToTop, {}), \"\\n\", _jsx(_components.h2, {\n      children: \"Readability\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"To check how easy your content is to read, use tools like \", _jsx(_components.a, {\n        href: \"https://hemingwayapp.com/\",\n        children: \"Hemingway Editor\"\n      }), \". Try to create content with a reading level of 9 or less – the lower, the better.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However, this reading level is only a general indicator. Keep in mind that readability scores can vary across readability tools.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We use Hemingway Editor because it’s simple and free to use. But wherever possible, test the readability of content with users.\"\n    }), \"\\n\", _jsx(BackToTop, {}), \"\\n\", _jsx(_components.h2, {\n      children: \"Concise\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Keep your sentences short. Bullet points can improve readability and make it easier for users to digest content. Use them to break up text and highlight list elements.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Limit paragraphs to just a few sentences. White space – the area on a web page around the text and other content – is an effective way to help make content accessible and keep cognitive load low.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Good use of white space on a page allows users to easily skim-read content to find what they are looking for. Try to keep white space in mind when you write. Avoid creating ‘walls of text’.\"\n    }), \"\\n\", _jsx(BackToTop, {}), \"\\n\", _jsx(_components.h2, {\n      children: \"Accessible and inclusive\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"All government web content must by law meet accessibility standards. This ensures that everyone can read and understand it.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"We encourage you to meet the requirements in the \", _jsx(_components.a, {\n        href: \"https://www.w3.org/TR/WCAG21/\",\n        children: \"Web Content Accessibility Guidelines (WCAG) 2.1\"\n      }), \".\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Content also needs to be inclusive. That is, cater for the diverse backgrounds and circumstances of our users. Avoid language that conveys stereotypes and prejudice.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Find more information on creating \", _jsx(_components.a, {\n        href: \"https://www.stylemanual.gov.au/accessible-and-inclusive-content\",\n        children: \"accessible and inclusive content\"\n      }), \". To find out how we build accessible components, see \", _jsx(_components.a, {\n        href: \"/foundations/accessibility\",\n        children: \"Accessibility\"\n      }), \".\"]\n    }), \"\\n\", _jsx(BackToTop, {}), \"\\n\", _jsx(_components.h2, {\n      children: \"Findable\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Many users come to content from search engines or site search. That means content needs to be found easily.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Ensure pages have descriptive headings if you create them for the public \", _jsx(_components.a, {\n        href: \"https://exports.agriculture.gov.au/\",\n        children: \"Export Service\"\n      }), \" site. They should reflect the language of users and describe what is on the page clearly.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The first heading (H1) at the top of the page should be unique. It’s also an important ranking factor for pages in search engines.\"\n    }), \"\\n\", _jsx(BackToTop, {}), \"\\n\", _jsx(_components.h2, {\n      children: \"Consistent\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Another way of reducing cognitive load is to keep content consistent. Try to keep content across the Export Service in the same \", _jsx(_components.a, {\n        href: \"./voice-and-tone\",\n        children: \"Voice and tone\"\n      }), \".\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Use the same names for common tasks. For example, ‘sign in’ (instead of ‘log in’) to the Export Service.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"To ensure content is consistent, follow our \", _jsx(_components.a, {\n        href: \"./content-styles\",\n        children: \"Content styles\"\n      }), \" and \", _jsx(_components.a, {\n        href: \"./content-patterns\",\n        children: \"Content patterns\"\n      }), \". This way users will have a seamless end-to-end journey from one page to another.\"]\n    }), \"\\n\", _jsx(BackToTop, {}), \"\\n\", _jsx(_components.h2, {\n      children: \"Accurate\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Content must be factually correct. Ensure you research content from credible sources and cross-check multiple sources of truth if you need to.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Check content with any relevant subject matter experts and make sure they confirm its accuracy.\"\n    }), \"\\n\", _jsx(BackToTop, {}), \"\\n\", _jsx(_components.h2, {\n      children: \"Comprehensive\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Ensure your content covers everything needed to support the page’s primary aim. This might include links to other supporting content or to more details.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But too much information can overwhelm users and increase their cognitive load. That is, provide more information than a user’s working memory can hold in the moment.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you think some users might want more detail than what’s necessary, use ‘progressive disclosure’. Progressive disclosure means providing content in stages.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Offer essential content to the user first. Provide any details that are relevant – but not essential – next on the same page, or by linking to another.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Users who just want to complete a task then have relevant content where they need it. But it still meets the needs of those who may want to know more.\"\n    }), \"\\n\", _jsx(BackToTop, {}), \"\\n\", _jsx(_components.h2, {\n      children: \"Contextual\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Let users know where they are on in the Export Service by providing site context, through \", _jsx(_components.a, {\n        href: \"/components/breadcrumbs\",\n        children: \"breadcrumbs\"\n      }), \" or other means.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Ensure the user has access to the right content when they need it, at each stage of their journey. It should be the least amount of information they need to ‘do the thing’ in the Export Service.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Make sure there are clear exit points and navigation to previous or next steps in the user journey. Link to related supporting content.\"\n    }), \"\\n\", _jsx(BackToTop, {}), \"\\n\", _jsx(_components.h2, {\n      children: \"Unique\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"While content should be consistent across the Export Service, it should not be uniform or duplicated.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Avoid using significant chunks of the same content across pages. It’s a bad user experience and may lower page rankings in search engine results.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Content for each web page should be unique so users and search engines can clearly understand the difference between them and easily select a relevant page.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"If content already appears on the Export Service or the \", _jsx(_components.a, {\n        href: \"https://www.agriculture.gov.au/\",\n        children: \"Department of Agriculture, Fisheries and Forestry\"\n      }), \" (DAFF) website, link to the authoritative source.\"]\n    }), \"\\n\", _jsx(BackToTop, {}), \"\\n\", _jsx(_components.hr, {}), \"\\n\", _jsx(_components.h2, {\n      children: \"Related links\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: _jsx(_components.a, {\n          href: \"/guides/how-to-create-guidance\",\n          children: \"How to create guidance in the Export Service\"\n        })\n      }), \"\\n\", _jsx(_components.li, {\n        children: _jsx(_components.a, {\n          href: \"./content-structure\",\n          children: \"Content structure\"\n        })\n      }), \"\\n\", _jsx(_components.li, {\n        children: _jsx(_components.a, {\n          href: \"./content-styles\",\n          children: \"Content styles\"\n        })\n      }), \"\\n\", _jsx(_components.li, {\n        children: _jsx(_components.a, {\n          href: \"./content-patterns\",\n          children: \"Content patterns\"\n        })\n      }), \"\\n\", _jsx(_components.li, {\n        children: _jsx(_components.a, {\n          href: \"/foundations/design-principles\",\n          children: \"Design principles\"\n        })\n      }), \"\\n\", _jsx(_components.li, {\n        children: _jsx(_components.a, {\n          href: \"https://www.stylemanual.gov.au/writing-and-designing-content\",\n          children: \"Writing and designing content I Style Manual\"\n        })\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Notes\"\n    }), \"\\n\", _jsx(FootnotesList, {\n      children: _jsxs(\"li\", {\n        id: \"cite-1\",\n        children: [_jsx(_components.p, {\n          children: \"The ABS reports that approximately 45% of Australians over 15 years (or 7.3\\nmillion people) have literary skills of level 2 or below. They can’t\\ncomplete tasks where they need to:\"\n        }), _jsxs(\"ul\", {\n          children: [_jsx(\"li\", {\n            children: _jsx(_components.p, {\n              children: \"identify, interpret, or evaluate one or more pieces of information, and\"\n            })\n          }), _jsx(\"li\", {\n            children: _jsx(_components.p, {\n              children: \"construct meaning across larger chunks of text or perform multi-step\\noperations, while\"\n            })\n          }), _jsx(\"li\", {\n            children: _jsx(_components.p, {\n              children: \"disregarding irrelevant or inappropriate content to arrive at a\\ndecision.\"\n            })\n          })]\n        }), _jsxs(_components.p, {\n          children: [\"Source: Australian Bureau of Statistics (2013)  \", _jsx(_components.a, {\n            href: \"https://www.abs.gov.au/ausstats/abs@.nsf/Lookup/4228.0main+features202011-12\",\n            children: \"Programme for the\\nInternational Assessment of Adult Competencies,\\nAustralia\"\n          })]\n        })]\n      })\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{"title":"Content principles","description":"Keep these basic ideas in mind to write Export Service content, or any other content.","complete":"need to work out how to style small footer text","order":1}},"content":"\nYou can use these standards to guide you to create content that is clear and effective.\n\nGood content reduces the cognitive load on users and helps them achieve their aims more easily.\n\nIt provides everything users need to complete their task. But it does not increase their cognitive load with details they don’t.\n\n## Based on user needs\n\nGood content is based on evidence of our users’ needs.\n\nFor example, users who need to apply for a permit don’t need to understand the history of changes to related laws.\n\nUnderstand the primary user need for any service or product and design content to meet it.\n\n<BackToTop />\n\n## Plain language\n\nJust less than half of all Australians have a low level of literacy. <sup><a href=\"#cite-1\" id=\"ref-1\">1</a></sup>\n\nThose people who read at a high level of literacy don’t want to spend any more time to do a task than they need to. Everyone benefits from plain language.\n\nWhen you write and design content, use plain English. It should be as simple and clear as possible while still meeting the needs of users. Use short and simple words where you can.\n\nFor more information, see the ‘Writing in plain English’ section of the Writing guidance page (internal DAFF staff only). You can find it on DAFF’s SharePoint intranet site, The source.\n\n<BackToTop />\n\n## Readability\n\nTo check how easy your content is to read, use tools like [Hemingway Editor](https://hemingwayapp.com/). Try to create content with a reading level of 9 or less – the lower, the better.\n\nHowever, this reading level is only a general indicator. Keep in mind that readability scores can vary across readability tools.\n\nWe use Hemingway Editor because it’s simple and free to use. But wherever possible, test the readability of content with users.\n\n<BackToTop />\n\n## Concise\n\nKeep your sentences short. Bullet points can improve readability and make it easier for users to digest content. Use them to break up text and highlight list elements.\n\nLimit paragraphs to just a few sentences. White space – the area on a web page around the text and other content – is an effective way to help make content accessible and keep cognitive load low.\n\nGood use of white space on a page allows users to easily skim-read content to find what they are looking for. Try to keep white space in mind when you write. Avoid creating ‘walls of text’.\n\n<BackToTop />\n\n## Accessible and inclusive\n\nAll government web content must by law meet accessibility standards. This ensures that everyone can read and understand it.\n\nWe encourage you to meet the requirements in the [Web Content Accessibility Guidelines (WCAG) 2.1](https://www.w3.org/TR/WCAG21/).\n\nContent also needs to be inclusive. That is, cater for the diverse backgrounds and circumstances of our users. Avoid language that conveys stereotypes and prejudice.\n\nFind more information on creating [accessible and inclusive content](https://www.stylemanual.gov.au/accessible-and-inclusive-content). To find out how we build accessible components, see [Accessibility](/foundations/accessibility).\n\n<BackToTop />\n\n## Findable\n\nMany users come to content from search engines or site search. That means content needs to be found easily.\n\nEnsure pages have descriptive headings if you create them for the public [Export Service](https://exports.agriculture.gov.au/) site. They should reflect the language of users and describe what is on the page clearly.\n\nThe first heading (H1) at the top of the page should be unique. It’s also an important ranking factor for pages in search engines.\n\n<BackToTop />\n\n## Consistent\n\nAnother way of reducing cognitive load is to keep content consistent. Try to keep content across the Export Service in the same [Voice and tone](./voice-and-tone).\n\nUse the same names for common tasks. For example, ‘sign in’ (instead of ‘log in’) to the Export Service.\n\nTo ensure content is consistent, follow our [Content styles](./content-styles) and [Content patterns](./content-patterns). This way users will have a seamless end-to-end journey from one page to another.\n\n<BackToTop />\n\n## Accurate\n\nContent must be factually correct. Ensure you research content from credible sources and cross-check multiple sources of truth if you need to.\n\nCheck content with any relevant subject matter experts and make sure they confirm its accuracy.\n\n<BackToTop />\n\n## Comprehensive\n\nEnsure your content covers everything needed to support the page’s primary aim. This might include links to other supporting content or to more details.\n\nBut too much information can overwhelm users and increase their cognitive load. That is, provide more information than a user’s working memory can hold in the moment.\n\nIf you think some users might want more detail than what’s necessary, use ‘progressive disclosure’. Progressive disclosure means providing content in stages.\n\nOffer essential content to the user first. Provide any details that are relevant – but not essential – next on the same page, or by linking to another.\n\nUsers who just want to complete a task then have relevant content where they need it. But it still meets the needs of those who may want to know more.\n\n<BackToTop />\n\n## Contextual\n\nLet users know where they are on in the Export Service by providing site context, through [breadcrumbs](/components/breadcrumbs) or other means.\n\nEnsure the user has access to the right content when they need it, at each stage of their journey. It should be the least amount of information they need to ‘do the thing’ in the Export Service.\n\nMake sure there are clear exit points and navigation to previous or next steps in the user journey. Link to related supporting content.\n\n<BackToTop />\n\n## Unique\n\nWhile content should be consistent across the Export Service, it should not be uniform or duplicated.\n\nAvoid using significant chunks of the same content across pages. It’s a bad user experience and may lower page rankings in search engine results.\n\nContent for each web page should be unique so users and search engines can clearly understand the difference between them and easily select a relevant page.\n\nIf content already appears on the Export Service or the [Department of Agriculture, Fisheries and Forestry](https://www.agriculture.gov.au/) (DAFF) website, link to the authoritative source.\n\n<BackToTop />\n\n---\n\n## Related links\n\n- [How to create guidance in the Export Service](/guides/how-to-create-guidance)\n- [Content structure](./content-structure)\n- [Content styles](./content-styles)\n- [Content patterns](./content-patterns)\n- [Design principles](/foundations/design-principles)\n- [Writing and designing content I Style Manual](https://www.stylemanual.gov.au/writing-and-designing-content)\n\n## Notes\n\n<FootnotesList>\n\t<li id=\"cite-1\">\n\t\tThe ABS reports that approximately 45% of Australians over 15 years (or 7.3\n\t\tmillion people) have literary skills of level 2 or below. They can’t\n\t\tcomplete tasks where they need to:\n\t\t<ul>\n\t\t\t<li>\n\t\t\t\tidentify, interpret, or evaluate one or more pieces of information, and\n\t\t\t</li>\n\t\t\t<li>\n\t\t\t\tconstruct meaning across larger chunks of text or perform multi-step\n\t\t\t\toperations, while\n\t\t\t</li>\n\t\t\t<li>\n\t\t\t\tdisregarding irrelevant or inappropriate content to arrive at a\n\t\t\t\tdecision.\n\t\t\t</li>\n\t\t</ul>\n\t\tSource: Australian Bureau of Statistics (2013)  [Programme for the\n\t\tInternational Assessment of Adult Competencies,\n\t\tAustralia](https://www.abs.gov.au/ausstats/abs@.nsf/Lookup/4228.0main+features202011-12)\n\t</li>\n</FootnotesList>\n","data":{"title":"Content principles","description":"Keep these basic ideas in mind to write Export Service content, or any other content.","complete":"need to work out how to style small footer text","order":1},"title":"Content principles","description":"Keep these basic ideas in mind to write Export Service content, or any other content."},"navLinks":[{"href":"/content/content-principles","label":"Content principles"},{"href":"/content/content-structure","label":"Content structure"},{"href":"/content/voice-and-tone","label":"Voice and tone"},{"href":"/content/content-styles","label":"Content styles"},{"href":"/content/content-patterns","label":"Content patterns"}],"breadcrumbs":[{"href":"/","label":"Home"},{"href":"/content","label":"Content"},{"label":"Content principles"}],"toc":[{"id":"based-on-user-needs","title":"Based on user needs","level":2,"slug":"based-on-user-needs","items":[]},{"id":"plain-language","title":"Plain language","level":2,"slug":"plain-language","items":[]},{"id":"readability","title":"Readability","level":2,"slug":"readability","items":[]},{"id":"concise","title":"Concise","level":2,"slug":"concise","items":[]},{"id":"accessible-and-inclusive","title":"Accessible and inclusive","level":2,"slug":"accessible-and-inclusive","items":[]},{"id":"findable","title":"Findable","level":2,"slug":"findable","items":[]},{"id":"consistent","title":"Consistent","level":2,"slug":"consistent","items":[]},{"id":"accurate","title":"Accurate","level":2,"slug":"accurate","items":[]},{"id":"comprehensive","title":"Comprehensive","level":2,"slug":"comprehensive","items":[]},{"id":"contextual","title":"Contextual","level":2,"slug":"contextual","items":[]},{"id":"unique","title":"Unique","level":2,"slug":"unique","items":[]},{"id":"related-links","title":"Related links","level":2,"slug":"related-links","items":[]},{"id":"notes","title":"Notes","level":2,"slug":"notes","items":[]}]},"__N_SSG":true}