{"pageProps":{"breadcrumbs":[{"href":"/","label":"Home"},{"href":"/content","label":"Content"},{"label":"States and status"}],"description":"TODO PAGE DESC.","editPath":"/docs/content/foundations/accessibility/states-and-status.mdx","page":{"slug":"states-and-status","source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"States and status\\nClearly communicate change in state or status to all users. This keeps users informed about what’s happening, but it’s essential for people using assistive technologies.\\n[ in-page nav ]\\nStates and status in AgDS\\nWe use WCAG conformant states and status throughout the design system components, patterns, templates and documentation. You can use them to ensure clear communication of any change in states or status in your digital products and services.\\nOur use of states and status in our components achieved full WCAG conformance in accessibility audits in 2022 and 2024. Implementation of AgDS states and status in our patterns is demonstrated in the yourGov application.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Requirements\\n•\\tState changes and status messages are clearly communicated visually and to assistive technologies with ARIA attributes.\\n•\\tState changes and status messages are understood and conveyed by assistive technology.\\n•\\tColour is not used as the only visual means of conveying information, indicating an action, prompting a response, or distinguishing a visual element.\\n•\\tUse status messages to convey important changes in content, especially destructive ones.\\n•\\tStatus messages allow users to confirm, correct, or reverse actions that have legal, financial or data consequences.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Button\\nWe have different states for buttons to enhance usability, and we ensure colour alone is not used to convey this:\\n•\\tPrimary and secondary buttons have an underline on hover.\\n•\\tTertiary button underline disappears on hover.\\n•\\tIcon-only button increases size on hover.\\nFor more information, go to Button – accessibility.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Progress indicator\\n•\\tA clear status label is used, so that colour is not used as the only visual means of conveying the state of a step – for example, not started, in progress and completed.\\n•\\tA meaningful icon is used to quickly convey the state of the step.\\n•\\tSemantic code that conveys current step and its position in the total number of steps.\\nFor more information, go to Progress indicator – accessibility.\\nBenefits\\n•\\tProvides clear interaction feedback to all users.\\n•\\tHelps users understand when actions are being processed.\\n•\\tAll users can understand where they are up to in a process.\\n•\\tCommunicates system status clearly.\\n•\\tReduces anxiety by confirming user actions and completed tasks.\\n•\\tPrevents confusion when buttons are unavailable.\\n•\\tScreen reader users can understand which step they’re on in a process and how many steps remain.\\n•\\tAssistive technology can convey the purpose of each step and current progress.\\n•\\tImproves usability for voice control software users.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"WCAG references\\n•\\tUnderstanding success criterion 1.3.1 Info and relationships\\n•\\tUnderstanding success criterion 1.4.1 Use of colour\\n•\\tUnderstanding success criterion 3.3.4 Error prevention  (Legal, financial, data)\\n•\\tUnderstanding success criterion 4.1.2 Name, role, value\\n•\\tUnderstanding success criterion 4.1.3 Status messages\\n•\\tMaking content usable for people with cognitive and learning disabilities\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"content":"States and status\nClearly communicate change in state or status to all users. This keeps users informed about what’s happening, but it’s essential for people using assistive technologies.\n[ in-page nav ]\nStates and status in AgDS\nWe use WCAG conformant states and status throughout the design system components, patterns, templates and documentation. You can use them to ensure clear communication of any change in states or status in your digital products and services.\nOur use of states and status in our components achieved full WCAG conformance in accessibility audits in 2022 and 2024. Implementation of AgDS states and status in our patterns is demonstrated in the yourGov application.\n\nRequirements \n•\tState changes and status messages are clearly communicated visually and to assistive technologies with ARIA attributes.\n•\tState changes and status messages are understood and conveyed by assistive technology.\n•\tColour is not used as the only visual means of conveying information, indicating an action, prompting a response, or distinguishing a visual element.\n•\tUse status messages to convey important changes in content, especially destructive ones.\n•\tStatus messages allow users to confirm, correct, or reverse actions that have legal, financial or data consequences.\n\nButton\nWe have different states for buttons to enhance usability, and we ensure colour alone is not used to convey this:\n•\tPrimary and secondary buttons have an underline on hover.\n•\tTertiary button underline disappears on hover.\n•\tIcon-only button increases size on hover.\nFor more information, go to Button – accessibility.\n\nProgress indicator\n•\tA clear status label is used, so that colour is not used as the only visual means of conveying the state of a step – for example, not started, in progress and completed.\n•\tA meaningful icon is used to quickly convey the state of the step.\n•\tSemantic code that conveys current step and its position in the total number of steps.\nFor more information, go to Progress indicator – accessibility.\nBenefits\n•\tProvides clear interaction feedback to all users.\n•\tHelps users understand when actions are being processed.\n•\tAll users can understand where they are up to in a process.\n•\tCommunicates system status clearly.\n•\tReduces anxiety by confirming user actions and completed tasks.\n•\tPrevents confusion when buttons are unavailable.\n•\tScreen reader users can understand which step they’re on in a process and how many steps remain.\n•\tAssistive technology can convey the purpose of each step and current progress.\n•\tImproves usability for voice control software users.\n\nWCAG references\n•\tUnderstanding success criterion 1.3.1 Info and relationships\n•\tUnderstanding success criterion 1.4.1 Use of colour\n•\tUnderstanding success criterion 3.3.4 Error prevention  (Legal, financial, data)\n•\tUnderstanding success criterion 4.1.2 Name, role, value\n•\tUnderstanding success criterion 4.1.3 Status messages\n•\tMaking content usable for people with cognitive and learning disabilities\n\n","data":{},"title":"states-and-status","description":null},"pageTitle":"States and status","toc":[]},"__N_SSG":true}