{"pageProps":{"guide":{"slug":"contribution","source":{"compiledSource":"var p=Object.defineProperty,c=Object.defineProperties;var h=Object.getOwnPropertyDescriptors;var s=Object.getOwnPropertySymbols;var a=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var d=(e,t,n)=>t in e?p(e,t,{enumerable:!0,configurable:!0,writable:!0,value:n}):e[t]=n,o=(e,t)=>{for(var n in t||(t={}))a.call(t,n)&&d(e,n,t[n]);if(s)for(var n of s(t))r.call(t,n)&&d(e,n,t[n]);return e},u=(e,t)=>c(e,h(t));var l=(e,t)=>{var n={};for(var i in e)a.call(e,i)&&t.indexOf(i)<0&&(n[i]=e[i]);if(e!=null&&s)for(var i of s(e))t.indexOf(i)<0&&r.call(e,i)&&(n[i]=e[i]);return n};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var i=n,{components:e}=i,t=l(i,[\"components\"]);return mdx(MDXLayout,u(o(o({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"You can contribute to the Agriculture Design System (AgDS) in many ways including:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Reporting or fixing bugs,\"),mdx(\"li\",{parentName:\"ul\"},\"New component and pattern suggestions,\"),mdx(\"li\",{parentName:\"ul\"},\"Submitting pull requests to enhance existing components and patterns,\"),mdx(\"li\",{parentName:\"ul\"},\"Or even writing documentation\")),mdx(\"p\",null,\"All contributions should:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Align with the visual language and design principles of the system\"),mdx(\"li\",{parentName:\"ul\"},\"Offer improvement to the way all teams deliver their services\"),mdx(\"li\",{parentName:\"ul\"},\"Be made in collaboration with the Design System team\"),mdx(\"li\",{parentName:\"ul\"},\"Include designs documented in Figma, and\"),mdx(\"li\",{parentName:\"ul\"},\"If coded, be built using React.js\")),mdx(\"h2\",null,\"How to contribute\"),mdx(\"h3\",null,\"Check if it exists\"),mdx(\"p\",null,\"Before you propose a pattern or component, please check the design system documentation to see if something already exists and check our backlog to see if something is planned or already started.\"),mdx(\"h3\",null,\"Message the Design System Teams chat\"),mdx(\"p\",null,\"To propose a new component or pattern please message the Design System Teams chat and include the user need, visual examples (screenshots) and links to Figma. Please ensure details about interactivity, states, content requirements and responsive behaviour are detailed.\"),mdx(\"h3\",null,\"Wait for your contribution to be reviewed\"),mdx(\"p\",null,\"All proposed designs will be reviewed by the AgDS team but are open for comment on the Design System Teams chat by the design community.\"),mdx(\"h3\",null,\"Work with us once accepted\"),mdx(\"p\",null,\"If your design proposal is accepted, we will work with you to ensure the design aligns with the principles, interactive behaviours, and visual language of AgDS. We can then add the component to the AgDS backlog for development or work with you to develop the code and documentation if you need it faster than we can deliver.\"),mdx(\"h3\",null,\"Code contribution\"),mdx(\"p\",null,\"If your proposal to build is accepted, your design and code will need to meet our contribution criteria, use existing AgDS components and patterns (if applicable), and be developed in the open so that the AgDS team and the community has visibility of the work.\"),mdx(\"p\",null,\"Once your code is ready the AgDS team can work with you to review and publish the contribution.\"),mdx(\"h2\",null,\"Contribution criteria\"),mdx(\"h3\",null,\"Communicate the benefits to the users and the business\"),mdx(\"p\",null,\"All contributions should satisfy a user need and offer value to the way all teams deliver their services. Providing a clear rationale will help us to understand the problem you are solving for end users, internal users, and any potential business improvements it will create.\"),mdx(\"h3\",null,\"The contribution aligns with the visual language of the design system\"),mdx(\"p\",null,\"AgDS uses design tokens to create a simple, consistent, and inclusive visual language. This language helps users understand the interactive behaviour of our components and creates a common language between designers and developers. Tokens are used for background and foreground colour, space, typography, border, shadow, and corner radius.\"),mdx(\"p\",null,\"All designs should use AgDS tokens to maintain visual and functional consistency with other design system components and patterns. Information about the tokens and how to apply them can be found on the \",mdx(\"a\",o({parentName:\"p\"},{href:\"https://steelthreads.github.io/agds-next/packages/foundations/core\"}),\"Core page\"),\" of our documentation site and \",mdx(\"a\",o({parentName:\"p\"},{href:\"https://www.figma.com/files/project/37217032/AgDS-Agriculture-Design-System?fuid=989721230907238166\"}),\"Figma design file\"),\".\"),mdx(\"h3\",null,\"Aligns with our design principles.\"),mdx(\"p\",null,\"Our design system is a continuation of the Australian Government Design System, which was built on principles of simplicity and inclusion. AgDS maintains these basic design principles to ensure our services are fast, intuitive, and easy to use and can be accessed by users of all abilities in any location. More information about our principles can be found \",mdx(\"a\",o({parentName:\"p\"},{href:\"/agds-next/guides/design-principles\"}),\"here\"),\".\"),mdx(\"h3\",null,\"Meets our design standard.\"),mdx(\"p\",null,\"Accessibility is a foundation of AgDS. Any design or code contributed must meet WCAG 2.1 AA as a minimum.\"),mdx(\"p\",null,\"AgDS is built using React.js and Typescript. Any code contributions should meet minimum code hygiene levels outlined \",mdx(\"a\",o({parentName:\"p\"},{href:\"https://github.com/steelthreads/agds-next/blob/main/CONTRIBUTING.md\"}),\"in this guide\"),\". We work in GitHub so contribution can be made at \",mdx(\"a\",o({parentName:\"p\"},{href:\"https://github.com/steelthreads/agds-next\"}),\"the AgDS repository\"),\".\"),mdx(\"p\",null,\"All patterns and components of AgDS are designed to be used across common screen sizes. All contributed patterns and components need to be responsive and function from 320px mobile to 1400px desktop viewports.\"),mdx(\"h3\",null,\"Is unique\"),mdx(\"p\",null,\"Proposed patterns and components should be unique and not duplicate existing patterns and components of the design system unless your proposal is intended to replace or enhance something. Always check the design system to see if a solution already exists before starting your design, and check with the team to see if we are already working on something.\"),mdx(\"p\",null,\"If your pattern or component is not unique but improves user experience it may be considered as an enhancement of an existing pattern or component and may still be considered.\"),mdx(\"h3\",null,\"Provides broad value\"),mdx(\"p\",null,\"Patterns and components should offer value to multiple services or products teams before they will be considered for contribution to AgDS. Building, testing, and documenting a design system component or pattern takes time so a design that offers benefit to many teams will take priority.\"),mdx(\"h3\",null,\"Tested\"),mdx(\"p\",null,\"The fastest way to get your pattern or component into AgDS is to design, build it, test it with users, and provide the evidence. Validating your designs through usability testing will provide evidence to support your contribution.\"),mdx(\"p\",null,\"All contributions should be tested for accessibility against \",mdx(\"a\",o({parentName:\"p\"},{href:\"https://www.w3.org/TR/WCAG21/\"}),\"WCAG 2.1 AA\"),\" and checked for browser compatibility.\"))}MDXContent.isMDXComponent=!0;\n","scope":{"order":2,"title":"Contribution guidelines","description":"Contributing to the Agriculture Design System"}},"data":{"order":2,"title":"Contribution guidelines","description":"Contributing to the Agriculture Design System"},"title":"Contribution guidelines","description":"Contributing to the Agriculture Design System"},"guideLinks":[{"href":"/guides/getting-started","label":"Getting started"},{"href":"/guides/contribution","label":"Contribution guidelines"},{"href":"/guides/design-principles","label":"Design Principles"},{"href":"/guides/figma","label":"Figma library"},{"href":"/guides/forms","label":"Forms"},{"href":"/guides/responsive-props","label":"Responsive props"},{"href":"/guides/theme","label":"Colours and Theming"}],"breadcrumbs":[{"href":"/","label":"Home"},{"href":"/guides","label":"Guides"},{"label":"Contribution guidelines"}],"slug":"contribution"},"__N_SSG":true}